const map = {
     
  "o":"ஒ","oo":"ஓ",
  "au":"ஔ",

  "c": "ச்","nj": "ஞ்","th": "த்","ip": "ப்","im": "ம்","iv": "வ்",

  "kaa":"கா","ke":"கி","kii":"கீ","kuu":"கூ","kai":"கை","kau":"கௌ",

  "ngaa":"ஙா","ngii":"ஙீ","nguu":"ஙூ","ngee":"ஙே","ngai":"ஙை","ngoo":"ஙோ","ngau":"ஙௌ","ng":"ங்",

  "caa":"சா","cii":"சீ","cuu":"சூ","cee":"சே","cai":"சை","coo":"சோ","cau":"சௌ",

  "saa":"சா","si":"சி","sii":"சீ","su":"சு","suu":"சூ","se":"செ","see":"சே","sai":"சை","so":"சொ","soo":"சோ","sau":"சௌ",

  "jaa":"ஜா","jii":"ஜீ","juu":"ஜூ","jai":"ஜை","joo":"ஜோ","jau":"ஜௌ","j":"ஜ்",

  "taa":"டா","tii":"டீ","ttu":"டு","ttuu":"டூ","tte":"டெ","ttee":"டே","tto":"டொ","ttoo":"டோ","ttau":"டௌ","tt":"ட்",
  "nii":"நீ","nuu":"நூ","nee":"நே","noo":"நோ","nau":"நௌ",

  "nnaa":"ணா","nnii":"ணீ","nnuu":"ணூ","nnee":"ணே","nnai":"ணை","nnoo":"ணோ","nnau":"ணௌ",

  "paa":"பா","pii":"பீ","puu":"பூ","pee":"பே","pai":"பை","poo":"போ","pau":"பௌ","p":"ப்",

  "baa":"பா","bii":"பீ","buu":"பூ","bee":"பே","bai":"பை","boo":"போ","bau":"பௌ","b":"ப்",

  "mii":"மீ","muu":"மூ","may":"மே","mai":"மை","moo":"மோ","mau":"மௌ","m":"ம்",

  "yii":"யீ","yuu":"யூ","yee":"யே","yai":"யை","yoo":"யோ","yau":"யௌ","y":"ய்",

  "rii":"ரீ","ruu":"ரூ","rai":"ரை","roo":"ரோ","rau":"ரௌ",

  "laa":"லா","lii":"லீ","luu":"லூ","lee":"லே","lai":"லை","lau":"லௌ",

  "vii":"வீ","vuu":"வூ","vee":"வே","vai":"வை","voo":"வோ","vau":"வௌ",

  "zhii":"ழீ","zhuu":"ழூ","zhee":"ழே","zhai":"ழை","zhoo":"ழோ","zhau":"ழௌ","zh":"ழ்",

  "llaa":"ளா","llii":"ளீ","lluu":"ளூ","llee":"ளே","llai":"ளை","lloo":"ளோ","llau":"ளௌ","ll":"ள்",

  "rraa":"றா","rrii":"றீ","rruu":"றூ","rree":"றே","rrai":"றை","rroo":"றோ","rrau":"றௌ","rr":"ற்",  

  "naa":"னா","nii":"னீ","nu":"னு","nuu":"னூ","nee":"னே","noo":"னோ","nau":"னௌ",
    
  "ksha":"க்ஷ",
  "sri":"ஸ்ரீ",
  "shri":"ஸ்ரீ",
  "om":"ஓம்",

  "thaa":"தா",
  "thii":"தீ",  
  "thee":"தே",
  "thai":"தை",
  "thoo":"தோ",
  "thau":"தௌ",

  "dhaa":"தா",
  "gaa":"கா",

  "fa":"ஃப",
  "fi":"ஃபி",
  "fu":"ஃபு",
  "fe":"ஃபெ",
  "fo":"ஃபொ",


  "xa":"க்ஸ",
  "xaa":"க்ஸா",

  "gna":"ஜ்ஞ",
  "ksha":"க்ஷ",
  "sree":"ஸ்ரீ",

  "ky":"கி",  
  "ic":"க்",
  "n": "ஞ்",

  "ha":"ஹ",
  "hi":"ஹி",
  "hu":"ஹு",
  "he":"ஹெ",
  "ho":"ஹொ",
  
  "v":["வி","வ்"],
  "tai":["டை","தை"],
  "dai":["டை","தை"],
  "d":["டி","டீ"],
  "t":["டி","டீ"],
  "in":["ண்","ன்","ங்"],
  "s":["ஸ்","ஷ்","ச்"],
  "sh":["ஸ்","ஷ்"],
  "esh":["ஸ்","ஷ்"],
  "n":["ந்","ன்","ண்"],
  "k":["கெ","க்","கே"],
  "l":["ல்","ள்","ழ்"],
  "ir":["ர்","ற்","இ"],
  "u":["உ","ஊ"],
  "r":["ர்","ற்"],
  "it":["ட்","ற்"],

  "ka":["க","கா"],
  "ki":["கி","கீ"],
  "ku":["கு","கூ"],
  "ke":["கெ","கே"],
  "ko":["கொ","கோ"],

  "nga":["ங","ஙா"],
  "ngi":["ஙி","ஙீ"],
  "ngu":["ஙு","ஙூ"],
  "nge":["ஙெ","ஙே"],
  "ngo":["ஙொ","ஙோ"],

  "ca":["ச","க"],
  "ci":["சி","சீ"],
  "cu":["சு","சூ"],
  "ce":["செ","சே"],
  "co":["சொ","சோ"],

  "cha":["ச","சா"],
  "chi":["சி","சீ"],
  "chu":["சு","சூ"],
  "che":["செ","சே"],
  "cho":["சொ","சோ"],

  "ja":["ஜ","ஜா"],
  "ji":["ஜி","ஜீ"],
  "ju":["ஜு","சு"],
  "je":["ஜெ","ஜே"],
  "jo":["ஜொ","ஜோ"],

  "ta":["ட","டா","த"],
  "ti":["டி","டீ","தி","தீ"],
  "tu":["டு","டூ"],
  "te":["டெ","டே"],
  "to":["டொ","டோ"],

  "tha":["த","தா"],
  "thi":["தி","தீ"],
  "thu":["து","தூ"],
  "the":["தெ","தே"],
  "tho":["தொ","தோ"],

  "da":["ட","டா","த"],
  "di":["டி","டீ","தி","தீ"],
  "du":["டு","து"],
  "de":["டெ","தெ"],
  "do":["டொ","தொ"],

  "na":["ந","ண","ன", "நா"],
  "ni":["நி","ணி","னி"],
  "nu":["நு","ணு","னு"],
  "ne":["நெ","ணெ","னெ"],
  "no":["நொ","ணொ","னொ"],

  "nna":["ண","னா"],
  "nni":["ணி","ணீ"],
  "nnu":["ணு","ணூ"],
  "nne":["ணெ","ணே"],
  "nno":["ணொ","ணோ"],

  "p":["பி","பீ"],
  "pa":["ப","பா"],
  "pi":["பி","பீ"],
  "pu":["பு","பூ"],
  "pe":["பெ","பே"],
  "po":["பொ","போ"],

  "ba":["ப","பா"],
  "bi":["பி","பீ"],
  "bu":["பு","பூ"],
  "be":["பெ","பே"],
  "bo":["பொ","போ"],

  "ma":["ம","மா"],
  "mi":["மி","மீ"],
  "mu":["மு","மூ"],
  "me":["மெ","மே"],
  "mo":["மொ","மோ"],

  "ya":["ய","யா"],
  "yi":["யி","யீ"],
  "yu":["யு","யூ"],
  "ye":["யெ","யே"],
  "yo":["யொ","யோ"],

  "ra":["ர","ற","ரா"],
  "ri":["ரி","றி"],
  "ru":["ரு","று"],
  "re":["ரெ","ரே"],
  "ro":["ரொ","ரோ"],

  "la":["ல","ள","ழ"],
  "li":["லி","ளி","ழி"],
  "lu":["லு","ளு","ழு"],
  "le":["லெ","ளெ","ழெ"],
  "lo":["லொ","லோ","ளொ","ழொ"],

  "va":["வ","வா"],
  "vi":["வி","வீ"],
  "vu":["வு","வூ"],
  "ve":["வெ","வே"],
  "vo":["வொ","வோ"],

  "zha":["ழ","ழா"],
  "zhi":["ழி","ழீ"],
  "zhu":["ழு","ழூ"],
  "zhe":["ழெ","ழே"],
  "zho":["ழொ","ழோ"],

  "lla":["ள","ளா"],
  "lli":["ளி","ளீ"],
  "llu":["ளு","ளூ"],
  "lle":["ளெ","ளே"],
  "llo":["ளொ","ளோ"],

  "rra":["ற","றா"],
  "rri":["றி","றீ"],
  "rru":["று","றூ"],
  "rre":["றெ","றே"],
  "rro":["றொ","றோ"],

  "sha":["ஷ","ச","ஷா"],
  "shi":["ஷி","சி"],
  "shu":["ஷு","சு"],
  "she":["ஷெ","செ"],
  "sho":["ஷொ","சொ"],

  "sa":["ஸ","ச"],
  "ssa":["ஸ","ச"],
  "ssi":["ஸி","சி"],
  "ssu":["ஸு","சு"],
  "sse":["ஸெ","செ"],
  "sso":["ஸொ","சொ"],

  "ga":["க","கா"],
  "gi":["கி","கீ"],
  "gu":["கு","கூ"],
  "ge":["கெ","கே"],
  "go":["கொ","கோ"],

  "dha":["த","தா"],
  "dhi":["தி","தீ"],
  "dhu":["து","தூ"],
  "dhe":["தெ","தே"],
  "dho":["தொ","தோ"],
  "ah":["அ","ஆ"],
  "a":["எ","ஏ","அ","ஆ"],
  "i":["இ","ஐ","வ",],
  "iy":["ய்","யி"],
  "e":["இ","ஈ","எ","ஏ","யி"],
  "nai":["நை","னை"],
  };
